A teacher wants to store the names of the students along with their roll
numbers or serial numbers in a proper format. How can you help the teacher accomplish this task? How will Series help you solve it?

In [13]:
name  = ['harsh','anika','kartik','shivani','sunil','zoya', 'yash','ashad','bhanu','ishita']

In [1]:
import pandas as pd
import numpy as np

In [15]:
S = pd.Series(name)
S

0      harsh
1      anika
2     kartik
3    shivani
4      sunil
5       zoya
6       yash
7      ashad
8      bhanu
9     ishita
dtype: object

In [16]:
S.index

RangeIndex(start=0, stop=10, step=1)

In [17]:
S.values

array(['harsh', 'anika', 'kartik', 'shivani', 'sunil', 'zoya', 'yash',
       'ashad', 'bhanu', 'ishita'], dtype=object)

In [18]:
index= np.arange(1,11)
S = pd.Series(name, index= index)
S

1       harsh
2       anika
3      kartik
4     shivani
5       sunil
6        zoya
7        yash
8       ashad
9       bhanu
10     ishita
dtype: object

In [ ]:
#create a series to store data of your 5 favourite books their index are from 101 to 105

In [12]:
books= ['harry potter','lord of rings','American Psycho','The Alchemist','it end with us']

In [13]:
S = pd.Series(books)
S

0       harry potter
1      lord of rings
2    American Psycho
3      The Alchemist
4     it end with us
dtype: object

In [14]:
index= np.arange(101,106)
S = pd.Series(books, index= index)
S

101       harry potter
102      lord of rings
103    American Psycho
104      The Alchemist
105     it end with us
dtype: object

In [ ]:
#An e-commerce company wants to represent the customer IDs thats consist  of alphamumeric characters along with their spending
#scores [1-100]. How can you accomplish this task?

In [15]:
index = ['a1','a2', 'a3', 'a4', 'a5']
values = [43,56,87,90,32]    #np.arange(43,48)

In [16]:
spending_score = pd.Series(values, index = index)
spending_score

a1    43
a2    56
a3    87
a4    90
a5    32
dtype: int64

In [18]:
d1 = {1:'Kartik', 2:'harsh',3:'subham',4:'ravi'}           #dictionary
d1

{1: 'Kartik', 2: 'harsh', 3: 'subham', 4: 'ravi'}

In [20]:
x=pd.Series(d1)
x

1    Kartik
2     harsh
3    subham
4      ravi
dtype: object

In [22]:
name = ["Benjamin","Liam" , "John", "Smith" , "Warner", "David", "Micheal", "James", "Dennis", "Rossum"]
Sal=  [25000, 26000, 23000, 27000, 28000, 28500, 24000, 30000, 29000, 24700]

In [23]:
Ser = pd.Series(Sal,index=name)
Ser

Benjamin    25000
Liam        26000
John        23000
Smith       27000
Warner      28000
David       28500
Micheal     24000
James       30000
Dennis      29000
Rossum      24700
dtype: int64

In [24]:
Ser['Dennis']

29000

In [25]:
Ser[8]

29000

In [26]:
Ser[-2]

29000

In [27]:
#multiple indexing

In [28]:
Ser[:5]

Benjamin    25000
Liam        26000
John        23000
Smith       27000
Warner      28000
dtype: int64

In [29]:
Ser["Benjamin":"Warner"]

Benjamin    25000
Liam        26000
John        23000
Smith       27000
Warner      28000
dtype: int64

In [30]:
Ser[-3:]

James     30000
Dennis    29000
Rossum    24700
dtype: int64

In [31]:
condition = Ser<25000

In [32]:
Ser[condition]

John       23000
Micheal    24000
Rossum     24700
dtype: int64

In [33]:
condition = Ser<25000

In [34]:
Ser[condition]

John       23000
Micheal    24000
Rossum     24700
dtype: int64

In [39]:
ser= Ser*1.2
ser

Benjamin    30000.0
Liam        31200.0
John        27600.0
Smith       32400.0
Warner      33600.0
David       34200.0
Micheal     28800.0
James       36000.0
Dennis      34800.0
Rossum      29640.0
dtype: float64

In [40]:
#greater than 32000

In [41]:
condition = ser>32000

In [42]:
ser[condition]

Smith     32400.0
Warner    33600.0
David     34200.0
James     36000.0
Dennis    34800.0
dtype: float64

In [43]:
new_ser = pd.Series([34000, 23409, 34270, 30172, 32140], index = ["Henry", 'Rajeev', 'Vinay', 'Amar','Omkar'])
new_ser

Henry     34000
Rajeev    23409
Vinay     34270
Amar      30172
Omkar     32140
dtype: int64

In [44]:
new_ser = pd.concat([ser, new_ser])                   #concating two series ser and new_ser
new_ser

Benjamin    30000.0
Liam        31200.0
John        27600.0
Smith       32400.0
Warner      33600.0
David       34200.0
Micheal     28800.0
James       36000.0
Dennis      34800.0
Rossum      29640.0
Henry       34000.0
Rajeev      23409.0
Vinay       34270.0
Amar        30172.0
Omkar       32140.0
dtype: float64

In [45]:
new_ser.sum()

472231.0

In [46]:
new_ser.mean()

31482.066666666666

In [47]:
new_ser.min()

23409.0

In [51]:
new_ser.max()

36000.0

In [49]:
new_ser.median()

32140.0

In [55]:
condition = new_ser<new_ser.mean()

In [56]:
new_ser[condition]

Benjamin    30000.0
Liam        31200.0
John        27600.0
Micheal     28800.0
Rossum      29640.0
Rajeev      23409.0
Amar        30172.0
dtype: float64

In [37]:
new_ser.sort_values()              #values in ascending order

John        23000.0
Rajeev      23409.0
Micheal     24000.0
Rossum      24700.0
Benjamin    25000.0
Liam        26000.0
Smith       27000.0
John        27600.0
Warner      28000.0
David       28500.0
Micheal     28800.0
Dennis      29000.0
Rossum      29640.0
Benjamin    30000.0
Liam        31200.0
Omkar       32140.0
Smith       32400.0
Warner      33600.0
Henry       34000.0
David       34200.0
Vinay       34270.0
Dennis      34800.0
James       35000.0
Amar        35000.0
James       36000.0
dtype: float64

In [57]:
new_ser.sort_values(ascending = False)          #descending order

James       36000.0
Dennis      34800.0
Vinay       34270.0
David       34200.0
Henry       34000.0
Warner      33600.0
Smith       32400.0
Omkar       32140.0
Liam        31200.0
Amar        30172.0
Benjamin    30000.0
Rossum      29640.0
Micheal     28800.0
John        27600.0
Rajeev      23409.0
dtype: float64

In [58]:
new_ser.sort_index()            #sorting Alphabatucally in ascending order

Amar        30172.0
Benjamin    30000.0
David       34200.0
Dennis      34800.0
Henry       34000.0
James       36000.0
John        27600.0
Liam        31200.0
Micheal     28800.0
Omkar       32140.0
Rajeev      23409.0
Rossum      29640.0
Smith       32400.0
Vinay       34270.0
Warner      33600.0
dtype: float64

In [59]:
condition = new_ser.between(30000, 32000, inclusive = 'both')    #salaries between 30000 and 32000
condition

Benjamin     True
Liam         True
John        False
Smith       False
Warner      False
David       False
Micheal     False
James       False
Dennis      False
Rossum      False
Henry       False
Rajeev      False
Vinay       False
Amar         True
Omkar       False
dtype: bool

In [60]:
between30_32 = new_ser[condition]
between30_32

Benjamin    30000.0
Liam        31200.0
Amar        30172.0
dtype: float64

In [61]:
new_ser.update(pd.Series([35000,35000], index = ['Liam', 'Amar']))        #update function
new_ser

Benjamin    30000.0
Liam        35000.0
John        27600.0
Smith       32400.0
Warner      33600.0
David       34200.0
Micheal     28800.0
James       36000.0
Dennis      34800.0
Rossum      29640.0
Henry       34000.0
Rajeev      23409.0
Vinay       34270.0
Amar        35000.0
Omkar       32140.0
dtype: float64

In [62]:
dup = new_ser.copy()            #copy()
dup

Benjamin    30000.0
Liam        35000.0
John        27600.0
Smith       32400.0
Warner      33600.0
David       34200.0
Micheal     28800.0
James       36000.0
Dennis      34800.0
Rossum      29640.0
Henry       34000.0
Rajeev      23409.0
Vinay       34270.0
Amar        35000.0
Omkar       32140.0
dtype: float64

In [63]:
name_to_drop  =['John','David']

In [64]:
dup.drop(name_to_drop)

Benjamin    30000.0
Liam        35000.0
Smith       32400.0
Warner      33600.0
Micheal     28800.0
James       36000.0
Dennis      34800.0
Rossum      29640.0
Henry       34000.0
Rajeev      23409.0
Vinay       34270.0
Amar        35000.0
Omkar       32140.0
dtype: float64

In [46]:
#Dataframe

In [120]:
df = pd.DataFrame(new_ser, columns=['Salary'])
df

           Salary
Benjamin  30000.0
Liam      35000.0
John      27600.0
Smith     32400.0
Warner    33600.0
David     34200.0
Micheal   28800.0
James     36000.0
Dennis    34800.0
Rossum    29640.0
Henry     34000.0
Rajeev    23409.0
Vinay     34270.0
Amar      35000.0
Omkar     32140.0

In [70]:
d2 = {"Name":["vishal", "sanjay", "prashant"], "roll_no":[1,2,3] ,'city':["Mumbai","Delhi","Bangalore"]}
d2

{'Name': ['vishal', 'sanjay', 'prashant'],
 'roll_no': [1, 2, 3],
 'city': ['Mumbai', 'Delhi', 'Bangalore']}

In [72]:
df2 = pd.DataFrame(d2)
df2

       Name  roll_no       city
0    vishal        1     Mumbai
1    sanjay        2      Delhi
2  prashant        3  Bangalore

In [86]:
import numpy as np
Di={'Roll_no':np.arange(1,11),
   "Name":["Benjamin","Liam", "Jhon", "Smith", "Warner", "David", "Micheal", "James", "Dennis", "Rossum"],
   "Percentage":[66.8, 78.9, 56.4, 61.5, 75.6, 80.6, 51.78, 51.78, 85.5,70.56]}

In [93]:
df3 = pd.DataFrame(Di, index = np.arange(1,11))             #changing index values
df3

    Roll_no      Name  Percentage
1         1  Benjamin       66.80
2         2      Liam       78.90
3         3      Jhon       56.40
4         4     Smith       61.50
5         5    Warner       75.60
6         6     David       80.60
7         7   Micheal       51.78
8         8     James       51.78
9         9    Dennis       85.50
10       10    Rossum       70.56

In [79]:
df3.Name

1     Benjamin
2         Liam
3         Jhon
4        Smith
5       Warner
6        David
7      Micheal
8        James
9       Dennis
10      Rossum
Name: Name, dtype: object

In [80]:
df3['Name']

1     Benjamin
2         Liam
3         Jhon
4        Smith
5       Warner
6        David
7      Micheal
8        James
9       Dennis
10      Rossum
Name: Name, dtype: object

In [81]:
df3[['Name']]           #use double square brackets to get this type of result

        Name
1   Benjamin
2       Liam
3       Jhon
4      Smith
5     Warner
6      David
7    Micheal
8      James
9     Dennis
10    Rossum

In [97]:
df3.iloc[4]                        #iloc() is index locaiton

Roll_no            5
Name          Warner
Percentage      75.6
Name: 5, dtype: object

In [98]:
df3.iloc[:4]

   Roll_no      Name  Percentage
1        1  Benjamin        66.8
2        2      Liam        78.9
3        3      Jhon        56.4
4        4     Smith        61.5

In [108]:
df3.iloc[:4,1]

1    Benjamin
2        Liam
3        Jhon
4       Smith
Name: Name, dtype: object

In [109]:
df3.iloc[:4,:1]

   Roll_no
1        1
2        2
3        3
4        4

In [110]:
df3.iloc[:4,1:]

       Name  Percentage
1  Benjamin        66.8
2      Liam        78.9
3      Jhon        56.4
4     Smith        61.5

In [116]:
df3.loc[:3,['Name','Percentage']]

       Name  Percentage
1  Benjamin        66.8
2      Liam        78.9
3      Jhon        56.4

In [117]:
df3

    Roll_no      Name  Percentage
1         1  Benjamin       66.80
2         2      Liam       78.90
3         3      Jhon       56.40
4         4     Smith       61.50
5         5    Warner       75.60
6         6     David       80.60
7         7   Micheal       51.78
8         8     James       51.78
9         9    Dennis       85.50
10       10    Rossum       70.56

In [118]:
condition = df3['Percentage']>70

In [119]:
df3[condition]

    Roll_no    Name  Percentage
2         2    Liam       78.90
5         5  Warner       75.60
6         6   David       80.60
9         9  Dennis       85.50
10       10  Rossum       70.56